DataProcessors/Лео_РеестрПремииНепрямымКлиентам/Лео_РеестрПремииНепрямымКлиентам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>Лео_РеестрПремииНепрямымКлиентам</name>
  <comment>1</comment>
  <tabularSections>
    <name>Реестр</name>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>СетьТорговаяТочка</name>
      <type>
        <types>CatalogRef.Лео_ТорговыеТочки</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

AccumulationRegisters/Лео_ПланФактПримииНепрямымКлиентам/Лео_ПланФактПримииНепрямымКлиентам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Лео_ПланФактПримииНепрямымКлиентам</name>
  <resources>
    <name>Товарооборот</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Премия</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ФиксированнаяСумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Сеть</name>
    <type>
      <types>CatalogRef.Лео_ТорговыеТочки</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТорговаяТочка</name>
    <type>
      <types>CatalogRef.Лео_ТорговыеТочки</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

InformationRegisters/Лео_ПареметрыРасчетаПремииКлиентам/Лео_ПареметрыРасчетаПремииКлиентам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Лео_ПареметрыРасчетаПремииКлиентам</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <attributes>
    <name>ПроцентПремии</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФиксированнаяСумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГодовойТоварооборот</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Действует</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НДС</name>
    <type>
      <types>EnumRef.СтавкиНДС</types>
    </type>
  </attributes>
  <attributes>
    <name>ТоварооборотСУчетомНДС</name>
    <type>
      <types>EnumRef.СтавкиНДС</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипОтчета</name>
    <type>
      <types>EnumRef.Лео_ТипОтчетаНепрямыхКлиентов</types>
    </type>
  </attributes>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сеть</name>
    <type>
      <types>CatalogRef.Лео_ТорговыеТочки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Периодичность</name>
    <type>
      <types>EnumRef.Периодичность</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Documents/Лео_РасчетПремииНепрямымКлиентам/Лео_РасчетПремииНепрямымКлиентам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Лео_РасчетПремииНепрямымКлиентам</name>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>НачалоПериода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КонецПериода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьВзаимозачет</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоговорПоставки</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерПриложения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Расчет</name>
    <attributes>
      <name>Сеть</name>
      <type>
        <types>CatalogRef.Лео_ТорговыеТочки</types>
      </type>
    </attributes>
    <attributes>
      <name>Товароборот</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ФиксированнаяСуммаПремии</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПроцентПремии</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Премия</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Номенклатура</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТорговыеТочки</name>
    <attributes>
      <name>ТорговыеТочки</name>
      <type>
        <types>CatalogRef.Лео_ТорговыеТочки</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Documents/Лео_ВводФактаТоварооборотаНепрямыхКлиентов/Лео_ВводФактаТоварооборотаНепрямыхКлиентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Лео_ВводФактаТоварооборотаНепрямыхКлиентов</name>
  <registerRecords>AccumulationRegister.Лео_ПланФактПримииНепрямымКлиентам</registerRecords>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Сеть</name>
    <type>
      <types>CatalogRef.Лео_ТорговыеТочки</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Период</name>
    <type>
      <types>EnumRef.Периодичность</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НачалоПериода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Факт</name>
    <attributes>
      <name>ТорговаяТочка</name>
      <type>
        <types>CatalogRef.Лео_ТорговыеТочки</types>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Товарооборот</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>14</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ФиксированнаяСуммаПремии</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>14</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПроцентПремии</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Премия</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>14</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Catalogs/Лео_ТорговыеТочки/Лео_ТорговыеТочки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Лео_ТорговыеТочки</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <owners>Catalog.Контрагенты</owners>
  <attributes>
    <name>НаименованиеПолное</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФармФуд</name>
    <type>
      <types>EnumRef.Лео_ФармФуд</types>
    </type>
  </attributes>
  <attributes>
    <name>БизнесРегион</name>
    <type>
      <types>CatalogRef.Регионы</types>
    </type>
  </attributes>
  <attributes>
    <name>Адрес</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ID</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>абс_РегионКЛАДР</name>
    <type>
      <types>CatalogRef.абс_Регионы</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_ГородКЛАДР</name>
    <type>
      <types>CatalogRef.абс_Города</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_Территория</name>
    <type>
      <types>CatalogRef.Регионы</types>
    </type>
  </attributes>
</mdclass:Catalog>

DataProcessors/Лео_РеестрПремииНепрямымКлиентам/Forms/Форма/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//ДатаНачалаГода = НачалоГода(ТекущаяДата());
	//ОбновитьДеревоЗначение ();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ДатаНачалаГода = НачалоГода(ТекущаяДата());
	ОбновитьДеревоЗначение ();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьДеревоЗначение () экспорт
	
	ДеревоЗначенийРеестр = РеквизитФормыВЗначение("ДеревоРеестр");	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НАЧАЛОПЕРИОДА(Лео_ПланФактПримииНепрямымКлиентам.Период, КВАРТАЛ) КАК НачалоКвартала
		|ПОМЕСТИТЬ ВТ_НачалоКвартала
		|ИЗ
		|	РегистрНакопления.Лео_ПланФактПримииНепрямымКлиентам КАК Лео_ПланФактПримииНепрямымКлиентам
		|ГДЕ
		|	Лео_ПланФактПримииНепрямымКлиентам.Период МЕЖДУ НАЧАЛОПЕРИОДА(&НачалоГода, ГОД) И КОНЕЦПЕРИОДА(&НачалоГода, ГОД)
		|
		|СГРУППИРОВАТЬ ПО
		|	НАЧАЛОПЕРИОДА(Лео_ПланФактПримииНепрямымКлиентам.Период, КВАРТАЛ)
		|;
		|////////////////////////////////////////////////////////////////////////////////
		|
		| ВЫБРАТЬ Различные
		|	Лео_РасчетПремииНепрямымКлиентамРасчет.Ссылка.НачалоПериода как НачалоПериода,
		|	Лео_РасчетПремииНепрямымКлиентамРасчет.Ссылка.Контрагент как Контрагент,
		|	Лео_РасчетПремииНепрямымКлиентамРасчет.Ссылка.Договор как Договор,
		|	Лео_РасчетПремииНепрямымКлиентамРасчет.Сеть,
		|	Лео_РасчетПремииНепрямымКлиентамРасчет.Премия как ФактСтоимостьУслуги
		| поместить ТЗ_ФактСтоимостьУслуги
		|ИЗ
		|	Документ.Лео_РасчетПремииНепрямымКлиентам.Расчет КАК Лео_РасчетПремииНепрямымКлиентамРасчет
		|ГДЕ
		|	Лео_РасчетПремииНепрямымКлиентамРасчет.Ссылка.НачалоПериода МЕЖДУ НАЧАЛОПЕРИОДА(&НачалоГода, ГОД) И КОНЕЦПЕРИОДА(&НачалоГода, ГОД)
		|
		|
		|
		|
		|;
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Лео_ПареметрыРасчетаПремииКлиентам.Контрагент,
		|	Лео_ПареметрыРасчетаПремииКлиентам.Сеть,
		|	Лео_ПареметрыРасчетаПремииКлиентам.Периодичность,
		|	Лео_ПареметрыРасчетаПремииКлиентам.Договор,
		|	Лео_ПареметрыРасчетаПремииКлиентам.ПроцентПремии,
		|	Лео_ПареметрыРасчетаПремииКлиентам.ФиксированнаяСумма,
		|	Лео_ПареметрыРасчетаПремииКлиентам.ГодовойТоварооборот,
		|	ВТ_НачалоКвартала.НачалоКвартала,
		|	КВАРТАЛ(ВТ_НачалоКвартала.НачалоКвартала) КАК Квартал
		
		
		|ПОМЕСТИТЬ ВТ_ПараметрыНачисленияСрезНаКвартал_1
		|ИЗ
		|	РегистрСведений.Лео_ПареметрыРасчетаПремииКлиентам КАК Лео_ПареметрыРасчетаПремииКлиентам
		|
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_НачалоКвартала КАК ВТ_НачалоКвартала
		|		ПО Лео_ПареметрыРасчетаПремииКлиентам.Период <= ВТ_НачалоКвартала.НачалоКвартала
		|ГДЕ
		|	Лео_ПареметрыРасчетаПремииКлиентам.Действует = ИСТИНА
		|	И Лео_ПареметрыРасчетаПремииКлиентам.Период В
		|			(ВЫБРАТЬ ПЕРВЫЕ 1
		|				КВ.Период
		|			ИЗ
		|				РегистрСведений.Лео_ПареметрыРасчетаПремииКлиентам КАК КВ
		|			ГДЕ
		|				КВ.Период <= ВТ_НачалоКвартала.НачалоКвартала
		|				И КВ.Контрагент = Лео_ПареметрыРасчетаПремииКлиентам.Контрагент
		|				И КВ.Сеть = Лео_ПареметрыРасчетаПремииКлиентам.Сеть
		|			УПОРЯДОЧИТЬ ПО
		|				КВ.Период УБЫВ)
		|;
		
		
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ПараметрыНачисленияСрезНаКвартал_1.Контрагент,
		|	ВТ_ПараметрыНачисленияСрезНаКвартал_1.Сеть,
		|	ВТ_ПараметрыНачисленияСрезНаКвартал_1.Периодичность,
		|	ВТ_ПараметрыНачисленияСрезНаКвартал_1.Договор,
		|	ВТ_ПараметрыНачисленияСрезНаКвартал_1.ПроцентПремии,
		|	ВТ_ПараметрыНачисленияСрезНаКвартал_1.ФиксированнаяСумма,
		|	ВТ_ПараметрыНачисленияСрезНаКвартал_1.ГодовойТоварооборот,
		|	ВТ_ПараметрыНачисленияСрезНаКвартал_1.НачалоКвартала,
		|	ВТ_ПараметрыНачисленияСрезНаКвартал_1.Квартал,
		
		|	ТЗ_ФактСтоимостьУслуги.ФактСтоимостьУслуги
		
		|ПОМЕСТИТЬ ВТ_ПараметрыНачисленияСрезНаКвартал
		|ИЗ
		|	ВТ_ПараметрыНачисленияСрезНаКвартал_1 КАК ВТ_ПараметрыНачисленияСрезНаКвартал_1
        |  левое соединение ТЗ_ФактСтоимостьУслуги по
		|        ВТ_ПараметрыНачисленияСрезНаКвартал_1.НачалоКвартала = ТЗ_ФактСтоимостьУслуги.НачалоПериода
		|        И ВТ_ПараметрыНачисленияСрезНаКвартал_1.Контрагент = ТЗ_ФактСтоимостьУслуги.Контрагент
    	|        И ВТ_ПараметрыНачисленияСрезНаКвартал_1.Договор = ТЗ_ФактСтоимостьУслуги.Договор
		|        И ВТ_ПараметрыНачисленияСрезНаКвартал_1.Сеть = ТЗ_ФактСтоимостьУслуги.Сеть
		|
		|;
		
		
		
		
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Лео_ПареметрыРасчетаПремииКлиентамСрезПоследних.Контрагент,
		|	Лео_ПареметрыРасчетаПремииКлиентамСрезПоследних.Сеть,
		|	Лео_ПареметрыРасчетаПремииКлиентамСрезПоследних.Периодичность,
		|	Лео_ПареметрыРасчетаПремииКлиентамСрезПоследних.Договор,
		|	Лео_ПареметрыРасчетаПремииКлиентамСрезПоследних.ПроцентПремии,
		|	Лео_ПареметрыРасчетаПремииКлиентамСрезПоследних.ФиксированнаяСумма,
		|	Лео_ПареметрыРасчетаПремииКлиентамСрезПоследних.ГодовойТоварооборот
		|ПОМЕСТИТЬ ВТ_ПараметрыНачисления
		|ИЗ
		|	РегистрСведений.Лео_ПареметрыРасчетаПремииКлиентам.СрезПоследних(КОНЕЦПЕРИОДА(&НачалоГода, ГОД), ) КАК Лео_ПареметрыРасчетаПремииКлиентамСрезПоследних
		|ГДЕ
		|	Лео_ПареметрыРасчетаПремииКлиентамСрезПоследних.Действует = ИСТИНА
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ПараметрыНачисления.Контрагент,
		|	ВТ_ПараметрыНачисления.Сеть,
		|	ВТ_ПараметрыНачисления.Периодичность,
		|	ВТ_ПараметрыНачисления.Договор,
		|	ВТ_ПараметрыНачисления.ПроцентПремии,
		|	План.ТорговаяТочка,
		|	План.Квартал,
		|	ВЫБОР
		|		КОГДА План.Квартал = 1
		|			ТОГДА План.Товарооборот
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК ТоварооборотПоБюджету1Квартал,
		|	ВЫБОР
		|		КОГДА План.Квартал = 2
		|			ТОГДА План.Товарооборот
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК ТоварооборотПоБюджету2Квартал,
		|	ВЫБОР
		|		КОГДА План.Квартал = 3
		|			ТОГДА План.Товарооборот
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК ТоварооборотПоБюджету3Квартал,
		|	ВЫБОР
		|		КОГДА План.Квартал = 4
		|			ТОГДА План.Товарооборот
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК ТоварооборотПоБюджету4Квартал,
		|	ВЫБОР
		|		КОГДА План.Квартал = 1
		|			ТОГДА План.Премия
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК Бюджет1Квартал,
		|	ВЫБОР
		|		КОГДА План.Квартал = 2
		|			ТОГДА План.Премия
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК Бюджет2Квартал,
		|	ВЫБОР
		|		КОГДА План.Квартал = 3
		|			ТОГДА План.Премия
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК Бюджет3Квартал,
		|	ВЫБОР
		|		КОГДА План.Квартал = 4
		|			ТОГДА План.Премия
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК Бюджет4Квартал,
		|	0 КАК Факт1Квартал,
		|	0 КАК Факт2Квартал,
		|	0 КАК Факт3Квартал,
		|	0 КАК Факт4Квартал,
		|	0 КАК СтоимостьУслуги1Квартал,
		|	0 КАК СтоимостьУслуги2Квартал,
		|	0 КАК СтоимостьУслуги3Квартал,
		|	0 КАК СтоимостьУслуги4Квартал,
		|	ВЫБОР
		|		КОГДА План.Квартал = 1
		|			ТОГДА План.ФиксированнаяСумма
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК ФиксированнаяСумма1Квартал,
		|	ВЫБОР
		|		КОГДА План.Квартал = 2
		|			ТОГДА План.ФиксированнаяСумма
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК ФиксированнаяСумма2Квартал,
		|	ВЫБОР
		|		КОГДА План.Квартал = 3
		|			ТОГДА План.ФиксированнаяСумма
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК ФиксированнаяСумма3Квартал,
		|	ВЫБОР
		|		КОГДА План.Квартал = 4
		|			ТОГДА План.ФиксированнаяСумма
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК ФиксированнаяСумма4Квартал,
		|	0 КАК ПроцентПремии1Квартал,
		|	0 КАК ПроцентПремии2Квартал,
		|	0 КАК ПроцентПремии3Квартал,
		|	0 КАК ПроцентПремии4Квартал,
		
		
		|	0 КАК ФактСтоимость1Квартал,
		|	0 КАК ФактСтоимость2Квартал,
		|	0 КАК ФактСтоимость3Квартал,
		|	0 КАК ФактСтоимость4Квартал
		
		
		
		|ПОМЕСТИТЬ ВТ_ПланФакт
		|ИЗ
		|	ВТ_ПараметрыНачисления КАК ВТ_ПараметрыНачисления
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			КВАРТАЛ(Лео_ПланФактПримииНепрямымКлиентам.Период) КАК Квартал,
		|			Лео_ПланФактПримииНепрямымКлиентам.Контрагент КАК Контрагент,
		|			Лео_ПланФактПримииНепрямымКлиентам.Сеть КАК Сеть,
		|			Лео_ПланФактПримииНепрямымКлиентам.ТорговаяТочка КАК ТорговаяТочка,
		|			СУММА(Лео_ПланФактПримииНепрямымКлиентам.Товарооборот) КАК Товарооборот,
		|			СУММА(Лео_ПланФактПримииНепрямымКлиентам.Премия) КАК Премия,
		|			СУММА(Лео_ПланФактПримииНепрямымКлиентам.ФиксированнаяСумма) КАК ФиксированнаяСумма
		|		ИЗ
		|			РегистрНакопления.Лео_ПланФактПримииНепрямымКлиентам КАК Лео_ПланФактПримииНепрямымКлиентам
		|		ГДЕ
		|			Лео_ПланФактПримииНепрямымКлиентам.Период МЕЖДУ НАЧАЛОПЕРИОДА(&НачалоГода, ГОД) И КОНЕЦПЕРИОДА(&НачалоГода, ГОД)
		|			И Лео_ПланФактПримииНепрямымКлиентам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|		
		|		СГРУППИРОВАТЬ ПО
		|			КВАРТАЛ(Лео_ПланФактПримииНепрямымКлиентам.Период),
		|			Лео_ПланФактПримииНепрямымКлиентам.Контрагент,
		|			Лео_ПланФактПримииНепрямымКлиентам.Сеть,
		|			Лео_ПланФактПримииНепрямымКлиентам.ТорговаяТочка) КАК План
		|		ПО ВТ_ПараметрыНачисления.Контрагент = План.Контрагент
		|			И ВТ_ПараметрыНачисления.Сеть = План.Сеть
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВТ_ПараметрыНачисления.Контрагент,
		|	ВТ_ПараметрыНачисления.Сеть,
		|	ВТ_ПараметрыНачисления.Периодичность,
		|	ВТ_ПараметрыНачисления.Договор,
		|	ВТ_ПараметрыНачисления.ПроцентПремии,
		|	факт.ТорговаяТочка,
		|	факт.Квартал,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	ВЫБОР
		|		КОГДА факт.Квартал = 1
		|			ТОГДА факт.Товарооборот
		|		ИНАЧЕ 0
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА факт.Квартал = 2
		|			ТОГДА факт.Товарооборот
		|		ИНАЧЕ 0
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА факт.Квартал = 3
		|			ТОГДА факт.Товарооборот
		|		ИНАЧЕ 0
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА факт.Квартал = 4
		|			ТОГДА факт.Товарооборот
		|		ИНАЧЕ 0
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА факт.Квартал = 1
		|			ТОГДА факт.Премия
		|		ИНАЧЕ 0
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА факт.Квартал = 2
		|			ТОГДА факт.Премия
		|		ИНАЧЕ 0
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА факт.Квартал = 3
		|			ТОГДА факт.Премия
		|		ИНАЧЕ 0
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА факт.Квартал = 4
		|			ТОГДА факт.Премия
		|		ИНАЧЕ 0
		|	КОНЕЦ,
		|	0,
		|	0,
		|	0,
		|	0,
		|	ВложенныйЗапрос.ПроцентПремии1Квартал,
		|	ВложенныйЗапрос.ПроцентПремии2Квартал,
		|	ВложенныйЗапрос.ПроцентПремии3Квартал,
		|	ВложенныйЗапрос.ПроцентПремии4Квартал,
		
		|	ВложенныйЗапрос.ФактСтоимость1Квартал,
		|	ВложенныйЗапрос.ФактСтоимость2Квартал,
		|	ВложенныйЗапрос.ФактСтоимость3Квартал,
		|	ВложенныйЗапрос.ФактСтоимость4Квартал
		
		
		|ИЗ
		|	ВТ_ПараметрыНачисления КАК ВТ_ПараметрыНачисления
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			КВАРТАЛ(Лео_ПланФактПримииНепрямымКлиентам.Период) КАК Квартал,
		|			Лео_ПланФактПримииНепрямымКлиентам.Контрагент КАК Контрагент,
		|			Лео_ПланФактПримииНепрямымКлиентам.Сеть КАК Сеть,
		|			Лео_ПланФактПримииНепрямымКлиентам.ТорговаяТочка КАК ТорговаяТочка,
		|			СУММА(Лео_ПланФактПримииНепрямымКлиентам.Товарооборот) КАК Товарооборот,
		|			СУММА(Лео_ПланФактПримииНепрямымКлиентам.Премия) КАК Премия
		|		ИЗ
		|			РегистрНакопления.Лео_ПланФактПримииНепрямымКлиентам КАК Лео_ПланФактПримииНепрямымКлиентам
		|		ГДЕ
		|			Лео_ПланФактПримииНепрямымКлиентам.Период МЕЖДУ НАЧАЛОПЕРИОДА(&НачалоГода, ГОД) И КОНЕЦПЕРИОДА(&НачалоГода, ГОД)
		|			И Лео_ПланФактПримииНепрямымКлиентам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|		
		|		СГРУППИРОВАТЬ ПО
		|			КВАРТАЛ(Лео_ПланФактПримииНепрямымКлиентам.Период),
		|			Лео_ПланФактПримииНепрямымКлиентам.Контрагент,
		|			Лео_ПланФактПримииНепрямымКлиентам.Сеть,
		|			Лео_ПланФактПримииНепрямымКлиентам.ТорговаяТочка) КАК факт
		|			ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|				МАКСИМУМ(ВЫБОР
		|						КОГДА ВТ_ПараметрыНачисленияСрезНаКвартал.Квартал = 1
		|							ТОГДА ВТ_ПараметрыНачисленияСрезНаКвартал.ПроцентПремии
		|						ИНАЧЕ 0
		|					КОНЕЦ) КАК ПроцентПремии1Квартал,
		|				МАКСИМУМ(ВЫБОР
		|						КОГДА ВТ_ПараметрыНачисленияСрезНаКвартал.Квартал = 2
		|							ТОГДА ВТ_ПараметрыНачисленияСрезНаКвартал.ПроцентПремии
		|						ИНАЧЕ 0
		|					КОНЕЦ) КАК ПроцентПремии2Квартал,
		|				МАКСИМУМ(ВЫБОР
		|						КОГДА ВТ_ПараметрыНачисленияСрезНаКвартал.Квартал = 3
		|							ТОГДА ВТ_ПараметрыНачисленияСрезНаКвартал.ПроцентПремии
		|						ИНАЧЕ 0
		|					КОНЕЦ) КАК ПроцентПремии3Квартал,
		|				МАКСИМУМ(ВЫБОР
		|						КОГДА ВТ_ПараметрыНачисленияСрезНаКвартал.Квартал = 4
		|							ТОГДА ВТ_ПараметрыНачисленияСрезНаКвартал.ПроцентПремии
		|						ИНАЧЕ 0
		|					КОНЕЦ) КАК ПроцентПремии4Квартал,
		|				ВТ_ПараметрыНачисленияСрезНаКвартал.Контрагент КАК Контрагент,
		|				ВТ_ПараметрыНачисленияСрезНаКвартал.Сеть КАК Сеть,
		
		
		|				МАКСИМУМ(ВЫБОР
		|						КОГДА ВТ_ПараметрыНачисленияСрезНаКвартал.Квартал = 1
		|							ТОГДА ВТ_ПараметрыНачисленияСрезНаКвартал.ФактСтоимостьУслуги
		|						ИНАЧЕ 0
		|					КОНЕЦ) КАК ФактСтоимость1Квартал,
		|				МАКСИМУМ(ВЫБОР
		|						КОГДА ВТ_ПараметрыНачисленияСрезНаКвартал.Квартал = 2
		|							ТОГДА ВТ_ПараметрыНачисленияСрезНаКвартал.ФактСтоимостьУслуги
		|						ИНАЧЕ 0
		|					КОНЕЦ) КАК ФактСтоимость2Квартал,
		|				МАКСИМУМ(ВЫБОР
		|						КОГДА ВТ_ПараметрыНачисленияСрезНаКвартал.Квартал = 3
		|							ТОГДА ВТ_ПараметрыНачисленияСрезНаКвартал.ФактСтоимостьУслуги
		|						ИНАЧЕ 0
		|					КОНЕЦ) КАК ФактСтоимость3Квартал,
		|				МАКСИМУМ(ВЫБОР
		|						КОГДА ВТ_ПараметрыНачисленияСрезНаКвартал.Квартал = 4
		|							ТОГДА ВТ_ПараметрыНачисленияСрезНаКвартал.ФактСтоимостьУслуги
		|						ИНАЧЕ 0
		|					КОНЕЦ) КАК ФактСтоимость4Квартал
		
		
		|			ИЗ
		|				ВТ_ПараметрыНачисленияСрезНаКвартал КАК ВТ_ПараметрыНачисленияСрезНаКвартал
		|			
		|			СГРУППИРОВАТЬ ПО
		|				ВТ_ПараметрыНачисленияСрезНаКвартал.Контрагент,
		|				ВТ_ПараметрыНачисленияСрезНаКвартал.Сеть) КАК ВложенныйЗапрос
		|			ПО факт.Контрагент = ВложенныйЗапрос.Контрагент
		|				И факт.Сеть = ВложенныйЗапрос.Сеть
		|		ПО ВТ_ПараметрыНачисления.Контрагент = факт.Контрагент
		|			И ВТ_ПараметрыНачисления.Сеть = факт.Сеть
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЕСТЬNULL(ВложенныйЗапрос.Контрагент, ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) КАК Контрагент,
		|	ЕСТЬNULL(ВложенныйЗапрос.Сеть, ЗНАЧЕНИЕ(Справочник.Лео_ТорговыеТочки.ПустаяСсылка)) КАК Сеть,
		|	ВложенныйЗапрос.Периодичность КАК Периодичность,
		|	ВложенныйЗапрос.Договор КАК Договор,
		|	ВложенныйЗапрос.ПроцентПремии КАК ПроцентПремии,
		|	ЕСТЬNULL(ВложенныйЗапрос.ТорговаяТочка, ЗНАЧЕНИЕ(Справочник.Лео_ТорговыеТочки.ПустаяСсылка)) КАК ТорговаяТочка,
		|	ВложенныйЗапрос.ТоварооборотПоБюджету1Квартал КАК ТоварооборотПоБюджету1Квартал,
		|	ВложенныйЗапрос.ТоварооборотПоБюджету2Квартал КАК ТоварооборотПоБюджету2Квартал,
		|	ВложенныйЗапрос.ТоварооборотПоБюджету3Квартал КАК ТоварооборотПоБюджету3Квартал,
		|	ВложенныйЗапрос.ТоварооборотПоБюджету4Квартал КАК ТоварооборотПоБюджету4Квартал,
		|	ВложенныйЗапрос.Бюджет1Квартал КАК Бюджет1Квартал,
		|	ВложенныйЗапрос.Бюджет2Квартал КАК Бюджет2Квартал,
		|	ВложенныйЗапрос.Бюджет3Квартал КАК Бюджет3Квартал,
		|	ВложенныйЗапрос.Бюджет4Квартал КАК Бюджет4Квартал,
		|	ВложенныйЗапрос.Факт1Квартал КАК Факт1Квартал,
		|	ВложенныйЗапрос.Факт2Квартал КАК Факт2Квартал,
		|	ВложенныйЗапрос.Факт3Квартал КАК Факт3Квартал,
		|	ВложенныйЗапрос.Факт4Квартал КАК Факт4Квартал,
		|	ВложенныйЗапрос.СтоимостьУслуги1Квартал КАК СтоимостьУслуги1Квартал,
		|	ВложенныйЗапрос.СтоимостьУслуги2Квартал КАК СтоимостьУслуги2Квартал,
		|	ВложенныйЗапрос.СтоимостьУслуги3Квартал КАК СтоимостьУслуги3Квартал,
		|	ВложенныйЗапрос.СтоимостьУслуги4Квартал КАК СтоимостьУслуги4Квартал,
		|	ВложенныйЗапрос.ФиксированнаяСумма1Квартал КАК ФиксированнаяСумма1Квартал,
		|	ВложенныйЗапрос.ФиксированнаяСумма2Квартал КАК ФиксированнаяСумма2Квартал,
		|	ВложенныйЗапрос.ФиксированнаяСумма3Квартал КАК ФиксированнаяСумма3Квартал,
		|	ВложенныйЗапрос.ФиксированнаяСумма4Квартал КАК ФиксированнаяСумма4Квартал,
		|	ВложенныйЗапрос.Сеть.ФармФуд КАК ФармФуд,
		|	ВложенныйЗапрос.Сеть.БизнесРегион КАК БизнесРегион,
		|	ВложенныйЗапрос.ТоварооборотПоБюджету1Квартал + ВложенныйЗапрос.ТоварооборотПоБюджету2Квартал + ВложенныйЗапрос.ТоварооборотПоБюджету3Квартал + ВложенныйЗапрос.ТоварооборотПоБюджету4Квартал КАК ГодовойТоварооборот,
		|	ВложенныйЗапрос.ФиксированнаяСумма1Квартал + ВложенныйЗапрос.ФиксированнаяСумма2Квартал + ВложенныйЗапрос.ФиксированнаяСумма3Квартал + ВложенныйЗапрос.ФиксированнаяСумма4Квартал КАК ФиксированнаяСуммаПремии,
		|	ВложенныйЗапрос.Бюджет1Квартал + ВложенныйЗапрос.Бюджет2Квартал + ВложенныйЗапрос.Бюджет3Квартал + ВложенныйЗапрос.Бюджет4Квартал КАК ИторгоПремияНаГодСумма,
		|	0 КАК ИторгоПремияНаГодПроцент,
		|	ВложенныйЗапрос.ПроцентПремии1Квартал КАК ПроцентПремии1Квартал,
		|	ВложенныйЗапрос.ПроцентПремии2Квартал КАК ПроцентПремии2Квартал,
		|	ВложенныйЗапрос.ПроцентПремии3Квартал КАК ПроцентПремии3Квартал,
		|	ВложенныйЗапрос.ПроцентПремии4Квартал КАК ПроцентПремии4Квартал,
		
		|	ВложенныйЗапрос.ФактСтоимость1Квартал КАК ФактСтоимость1Квартал,
		|	ВложенныйЗапрос.ФактСтоимость2Квартал КАК ФактСтоимость2Квартал,
		|	ВложенныйЗапрос.ФактСтоимость3Квартал КАК ФактСтоимость3Квартал,
		|	ВложенныйЗапрос.ФактСтоимость4Квартал КАК ФактСтоимость4Квартал
		
		
		|ИЗ
		|	(ВЫБРАТЬ
		|		ВТ_ПланФакт.Контрагент КАК Контрагент,
		|		ВТ_ПланФакт.Сеть КАК Сеть,
		|		ВТ_ПланФакт.Периодичность КАК Периодичность,
		|		ВТ_ПланФакт.Договор КАК Договор,
		|		ВТ_ПланФакт.ПроцентПремии КАК ПроцентПремии,
		|		ВТ_ПланФакт.ТорговаяТочка КАК ТорговаяТочка,
		|		СУММА(ВТ_ПланФакт.ТоварооборотПоБюджету1Квартал) КАК ТоварооборотПоБюджету1Квартал,
		|		СУММА(ВТ_ПланФакт.ТоварооборотПоБюджету2Квартал) КАК ТоварооборотПоБюджету2Квартал,
		|		СУММА(ВТ_ПланФакт.ТоварооборотПоБюджету3Квартал) КАК ТоварооборотПоБюджету3Квартал,
		|		СУММА(ВТ_ПланФакт.ТоварооборотПоБюджету4Квартал) КАК ТоварооборотПоБюджету4Квартал,
		|		СУММА(ВТ_ПланФакт.Бюджет1Квартал) КАК Бюджет1Квартал,
		|		СУММА(ВТ_ПланФакт.Бюджет2Квартал) КАК Бюджет2Квартал,
		|		СУММА(ВТ_ПланФакт.Бюджет3Квартал) КАК Бюджет3Квартал,
		|		СУММА(ВТ_ПланФакт.Бюджет4Квартал) КАК Бюджет4Квартал,
		|		СУММА(ВТ_ПланФакт.Факт1Квартал) КАК Факт1Квартал,
		|		СУММА(ВТ_ПланФакт.Факт2Квартал) КАК Факт2Квартал,
		|		СУММА(ВТ_ПланФакт.Факт3Квартал) КАК Факт3Квартал,
		|		СУММА(ВТ_ПланФакт.Факт4Квартал) КАК Факт4Квартал,
		|		СУММА(ВТ_ПланФакт.СтоимостьУслуги1Квартал) КАК СтоимостьУслуги1Квартал,
		|		СУММА(ВТ_ПланФакт.СтоимостьУслуги2Квартал) КАК СтоимостьУслуги2Квартал,
		|		СУММА(ВТ_ПланФакт.СтоимостьУслуги3Квартал) КАК СтоимостьУслуги3Квартал,
		|		СУММА(ВТ_ПланФакт.СтоимостьУслуги4Квартал) КАК СтоимостьУслуги4Квартал,
		|		СУММА(ВТ_ПланФакт.ФиксированнаяСумма1Квартал) КАК ФиксированнаяСумма1Квартал,
		|		СУММА(ВТ_ПланФакт.ФиксированнаяСумма2Квартал) КАК ФиксированнаяСумма2Квартал,
		|		СУММА(ВТ_ПланФакт.ФиксированнаяСумма3Квартал) КАК ФиксированнаяСумма3Квартал,
		|		СУММА(ВТ_ПланФакт.ФиксированнаяСумма4Квартал) КАК ФиксированнаяСумма4Квартал,
		|		МАКСИМУМ(ВТ_ПланФакт.ПроцентПремии1Квартал) КАК ПроцентПремии1Квартал,
		|		МАКСИМУМ(ВТ_ПланФакт.ПроцентПремии2Квартал) КАК ПроцентПремии2Квартал,
		|		МАКСИМУМ(ВТ_ПланФакт.ПроцентПремии3Квартал) КАК ПроцентПремии3Квартал,
		|		МАКСИМУМ(ВТ_ПланФакт.ПроцентПремии4Квартал) КАК ПроцентПремии4Квартал,
		
		|		МАКСИМУМ(ВТ_ПланФакт.ФактСтоимость1Квартал) КАК ФактСтоимость1Квартал,
		|		МАКСИМУМ(ВТ_ПланФакт.ФактСтоимость2Квартал) КАК ФактСтоимость2Квартал,
		|		МАКСИМУМ(ВТ_ПланФакт.ФактСтоимость3Квартал) КАК ФактСтоимость3Квартал,
		|		МАКСИМУМ(ВТ_ПланФакт.ФактСтоимость4Квартал) КАК ФактСтоимость4Квартал
		
		|	ИЗ
		|		ВТ_ПланФакт КАК ВТ_ПланФакт
		|	
		|	СГРУППИРОВАТЬ ПО
		|		ВТ_ПланФакт.Контрагент,
		|		ВТ_ПланФакт.Сеть,
		|		ВТ_ПланФакт.Периодичность,
		|		ВТ_ПланФакт.Договор,
		|		ВТ_ПланФакт.ПроцентПремии,
		|		ВТ_ПланФакт.ТорговаяТочка) КАК ВложенныйЗапрос
		|ИТОГИ
		|	МАКСИМУМ(Контрагент),
		|	МАКСИМУМ(Периодичность),
		|	МАКСИМУМ(Договор),
		|	МАКСИМУМ(ПроцентПремии),
		|	МАКСИМУМ(ТорговаяТочка),
		|	СУММА(ТоварооборотПоБюджету1Квартал),
		|	СУММА(ТоварооборотПоБюджету2Квартал),
		|	СУММА(ТоварооборотПоБюджету3Квартал),
		|	СУММА(ТоварооборотПоБюджету4Квартал),
		|	СУММА(Бюджет1Квартал),
		|	СУММА(Бюджет2Квартал),
		|	СУММА(Бюджет3Квартал),
		|	СУММА(Бюджет4Квартал),
		|	СУММА(Факт1Квартал),
		|	СУММА(Факт2Квартал),
		|	СУММА(Факт3Квартал),
		|	СУММА(Факт4Квартал),
		|	СУММА(СтоимостьУслуги1Квартал),
		|	СУММА(СтоимостьУслуги2Квартал),
		|	СУММА(СтоимостьУслуги3Квартал),
		|	СУММА(СтоимостьУслуги4Квартал),
		|	СУММА(ФиксированнаяСумма1Квартал),
		|	СУММА(ФиксированнаяСумма2Квартал),
		|	СУММА(ФиксированнаяСумма3Квартал),
		|	СУММА(ФиксированнаяСумма4Квартал),
		|	МАКСИМУМ(ФармФуд),
		|	МАКСИМУМ(БизнесРегион),
		|	СУММА(ГодовойТоварооборот),
		|	СУММА(ФиксированнаяСуммаПремии),
		|	СУММА(ИторгоПремияНаГодСумма),
		|	СУММА(ИторгоПремияНаГодПроцент),
		|	МАКСИМУМ(ПроцентПремии1Квартал),
		|	МАКСИМУМ(ПроцентПремии2Квартал),
		|	МАКСИМУМ(ПроцентПремии3Квартал),
		|	МАКСИМУМ(ПроцентПремии4Квартал),
		
		|	МАКСИМУМ(ФактСтоимость1Квартал),
		|	МАКСИМУМ(ФактСтоимость2Квартал),
		|	МАКСИМУМ(ФактСтоимость3Квартал),
		|	МАКСИМУМ(ФактСтоимость4Квартал)
		
		
		|ПО
		|	Сеть";
    Запрос.УстановитьПараметр("НачалоГода", НачалоГода(ДатаНачалаГода));
	Результат = Запрос.Выполнить();
    
	
	ВыборкаСеть = Результат.Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкам);
	ДеревоЗначенийРеестр = ВыборкаСеть;
	ЗначениеВРеквизитФормы(ДеревоЗначенийРеестр,"ДеревоРеестр"); 
	
	ПересчитатьПоказатели();

	
КонецПроцедуры

&НаСервере
Процедура ПересчитатьПоказатели()
	ДеревоЗначенийРеестр = РеквизитФормыВЗначение("ДеревоРеестр");
	
	ЭлементыДерева = ДеревоЗначенийРеестр.Строки;
	Для Каждого ЭлементДерева Из ЭлементыДерева Цикл
		
		Если ЭлементДерева.ГодовойТоварооборот > 0 и ЭлементДерева.ИторгоПремияНаГодСумма  > 0 Тогда
			ЭлементДерева.ИторгоПремияНаГодПроцент = ЭлементДерева.ИторгоПремияНаГодСумма/ЭлементДерева.ГодовойТоварооборот	
		КонецЕсли;
		Если ЭлементДерева.Факт1Квартал > 0 и ЭлементДерева.ПроцентПремии > 0 Тогда
        	ЭлементДерева.СтоимостьУслуги1Квартал = ЭлементДерева.Факт1Квартал/100*ЭлементДерева.ПроцентПремии1Квартал
		КонецЕсли;
		Если ЭлементДерева.Факт2Квартал > 0 и ЭлементДерева.ПроцентПремии > 0 Тогда
        	ЭлементДерева.СтоимостьУслуги2Квартал = ЭлементДерева.Факт2Квартал/100*ЭлементДерева.ПроцентПремии2Квартал
		КонецЕсли;
		Если ЭлементДерева.Факт3Квартал > 0 и ЭлементДерева.ПроцентПремии > 0 Тогда
        	ЭлементДерева.СтоимостьУслуги3Квартал = ЭлементДерева.Факт3Квартал/100*ЭлементДерева.ПроцентПремии3Квартал
		КонецЕсли;
		Если ЭлементДерева.Факт4Квартал > 0 и ЭлементДерева.ПроцентПремии > 0 Тогда
        	ЭлементДерева.СтоимостьУслуги4Квартал = ЭлементДерева.Факт4Квартал/100*ЭлементДерева.ПроцентПремии4Квартал
		КонецЕсли;

		
        ЭлементыУр2 = ЭлементДерева.Строки;
        Для Каждого ЭлементУр2 Из ЭлементыУр2 Цикл
			Если ЭлементУр2.ГодовойТоварооборот > 0 и ЭлементУр2.ИторгоПремияНаГодСумма  > 0 Тогда
			ЭлементУр2.ИторгоПремияНаГодПроцент = ЭлементУр2.ИторгоПремияНаГодСумма/ЭлементУр2.ГодовойТоварооборот	
			КонецЕсли;
			
			
		Если ЭлементУр2.СтоимостьУслуги1Квартал =0 Тогда
			 ЭлементУр2.ФактСтоимость1Квартал = "";
		КонецЕсли;
		Если ЭлементУр2.СтоимостьУслуги2Квартал =0 Тогда
			 ЭлементУр2.ФактСтоимость2Квартал = "";
		КонецЕсли;
		Если ЭлементУр2.СтоимостьУслуги3Квартал =0 Тогда
			 ЭлементУр2.ФактСтоимость3Квартал = "";
		КонецЕсли;
		Если ЭлементУр2.СтоимостьУслуги4Квартал =0 Тогда
			 ЭлементУр2.ФактСтоимость4Квартал = "";
		КонецЕсли;
			
			
			
			
			
			
			
		КонецЦикла;
		
		
		Если ЭлементДерева.СтоимостьУслуги1Квартал =0 Тогда
			 ЭлементДерева.ФактСтоимость1Квартал = "";
		КонецЕсли;
		Если ЭлементДерева.СтоимостьУслуги2Квартал =0 Тогда
			 ЭлементДерева.ФактСтоимость2Квартал = "";
		КонецЕсли;
		Если ЭлементДерева.СтоимостьУслуги3Квартал =0 Тогда
			 ЭлементДерева.ФактСтоимость3Квартал = "";
		КонецЕсли;
		Если ЭлементДерева.СтоимостьУслуги4Квартал =0 Тогда
			 ЭлементДерева.ФактСтоимость4Квартал = "";
		КонецЕсли;
		
		
		
    КонецЦикла;
	ЗначениеВРеквизитФормы(ДеревоЗначенийРеестр,"ДеревоРеестр");	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоРеестрПередНачаломИзменения(Элемент, Отказ)
	
	Если  Элемент.ТекущийЭлемент.Имя = "ДеревоРеестрФакт1Квартал" или
	Элемент.ТекущийЭлемент.Имя = "ДеревоРеестрФакт2Квартал" или
	Элемент.ТекущийЭлемент.Имя = "ДеревоРеестрФакт3Квартал" или
    Элемент.ТекущийЭлемент.Имя = "ДеревоРеестрФакт4Квартал" Тогда
	
	    КнопкиДиалога = Новый СписокЗначений;
		КнопкиДиалога.Добавить(КодВозвратаДиалога.Да, НСтр("ru = 'Продолжить'"));
		КнопкиДиалога.Добавить(КодВозвратаДиалога.Нет, НСтр("ru = 'Нет'"));
		
		ТекстВопроса = "Выберите действие?";
				
		Кнопки = Новый СписокЗначений;
		Кнопки.Добавить(1, "Расшифровать");
		Кнопки.Добавить(2, "Ввести документ ввода факта");
		Кнопки.Добавить(3, "Ввести документ расчета");

		Кнопки.Добавить(КодВозвратаДиалога.Отмена);
		
		Ответ = Вопрос(ТекстВопроса, Кнопки, 60, 1,);
		
		ПараметрыДляНовогоДокумента = Новый Структура;
		ПараметрыДляНовогоДокумента.Вставить("Контрагент",Элемент.ТекущиеДанные.Контрагент);
		ПараметрыДляНовогоДокумента.Вставить("Сеть",Элемент.ТекущиеДанные.Сеть);
		ПараметрыДляНовогоДокумента.Вставить("Период",Элемент.ТекущиеДанные.Периодичность);
		ПараметрыДляНовогоДокумента.Вставить("Ответственный",ПараметрыСеанса.ТекущийПользователь);
		ПараметрыДляНовогоДокумента.Вставить("НачалоПериодаДокумента",ОпределенияНачалаПериодаДляКолонки (Элемент.ТекущийЭлемент.Имя,Элемент.ТекущиеДанные.Периодичность,ДатаНачалаГода));
		ПараметрыДляНовогоДокумента.Вставить("ТорговаяТочка",Элемент.ТекущиеДанные.ТорговаяТочка);
        ПараметрыДляНовогоДокумента.Вставить("ПроцентПремии",Элемент.ТекущиеДанные.ПроцентПремии);
		ПараметрыДляНовогоДокумента.Вставить("Договор",Элемент.ТекущиеДанные.Договор);
		
		Если Ответ = 1 Тогда
			СформироватьОтчетЛео_ФактТоварооборотаНепрямыхКлиентов(ПараметрыДляНовогоДокумента);
		ИначеЕсли   Ответ = 2 Тогда			
            СоздатьДокументЛео_ВводФактаТоварооборотаНепрямыхКлиентов (ПараметрыДляНовогоДокумента);
		ИначеЕсли   Ответ = 3 Тогда			
            СоздатьДокументЛео_РасчетПремииНепрямымКлиентам (ПараметрыДляНовогоДокумента);

		ИначеЕсли   Ответ = КодВозвратаДиалога.Отмена Тогда
			
		КонецЕсли;
		  
		Отказ = Истина	
	КонецЕсли
КонецПроцедуры


&НаКлиенте
Функция ОпределенияНачалаПериодаДляКолонки (ИмяКолонки,Периодичность,ДатаНачалаГода)
	Если Найти(ИмяКолонки,"1Квартал") > 0 Тогда
		Возврат	 Дата(Год(ДатаНачалаГода),01,01);
	ИначеЕсли Найти(ИмяКолонки,"2Квартал") > 0 Тогда
		Возврат	 Дата(Год(ДатаНачалаГода),04,01);
	ИначеЕсли Найти(ИмяКолонки,"3Квартал") > 0 Тогда
        Возврат	 Дата(Год(ДатаНачалаГода),07,01);
	ИначеЕсли Найти(ИмяКолонки,"4Квартал") > 0 Тогда
        Возврат	 Дата(Год(ДатаНачалаГода),10,01);
	КонецЕсли;
КонецФункции

&НаКлиенте
Процедура СоздатьДокументЛео_ВводФактаТоварооборотаНепрямыхКлиентов(ПараметрыДляНовогоДокумента)

Форма = ПолучитьФорму("Документ.Лео_ВводФактаТоварооборотаНепрямыхКлиентов.ФормаОбъекта");
ДанныеФормы = Форма.Объект; 
ЗаполнитьДокументЛео_ВводФактаТоварооборотаНепрямыхКлиентовНаСервере(ДанныеФормы,ПараметрыДляНовогоДокумента); 
КопироватьДанныеФормы(ДанныеФормы, Форма.Объект); 
Форма.ОткрытьМодально();

ОбновитьДеревоЗначение ();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДокументЛео_ВводФактаТоварооборотаНепрямыхКлиентовНаСервере (ДанныеФормы,ПараметрыДляНовогоДокумента)
	
	ДанныеФормы.Контрагент = ПараметрыДляНовогоДокумента.Контрагент;
	ДанныеФормы.Сеть = ПараметрыДляНовогоДокумента.Сеть;
	ДанныеФормы.Период = ПараметрыДляНовогоДокумента.Период;
	ДанныеФормы.Ответственный = ПараметрыДляНовогоДокумента.Ответственный;
	ДанныеФормы.НачалоПериода = ПараметрыДляНовогоДокумента.НачалоПериодаДокумента;
	
	Если НЕ ПараметрыДляНовогоДокумента.ТорговаяТочка = Справочники.Лео_ТорговыеТочки.ПустаяСсылка()Тогда
		СтрокаФакта =  ДанныеФормы.Факт.Добавить();
		СтрокаФакта.ТорговаяТочка = ПараметрыДляНовогоДокумента.ТорговаяТочка;
		СтрокаФакта.ПроцентПремии = ПараметрыДляНовогоДокумента.ПроцентПремии;
	КонецЕсли;

	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьДокументЛео_РасчетПремииНепрямымКлиентам(ПараметрыДляНовогоДокумента)

Форма = ПолучитьФорму("Документ.Лео_РасчетПремииНепрямымКлиентам.ФормаОбъекта");
ДанныеФормы = Форма.Объект; 
ЗаполнитьДокументЛео_РасчетПремииНепрямымКлиентамНаСервере(ДанныеФормы,ПараметрыДляНовогоДокумента); 
КопироватьДанныеФормы(ДанныеФормы, Форма.Объект); 
Форма.ОткрытьМодально();

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДокументЛео_РасчетПремииНепрямымКлиентамНаСервере (ДанныеФормы,ПараметрыДляНовогоДокумента)
	
	ДанныеФормы.Контрагент = ПараметрыДляНовогоДокумента.Контрагент;
	ДанныеФормы.НачалоПериода = ПараметрыДляНовогоДокумента.НачалоПериодаДокумента;
	ДанныеФормы.КонецПериода = КонецКвартала(ПараметрыДляНовогоДокумента.НачалоПериодаДокумента);
	ДанныеФормы.Договор = ПараметрыДляНовогоДокумента.Договор;
	
	//Заполняем табличную часть
	СтрокаРасчета = ДанныеФормы.Расчет.Добавить();
	СтрокаРасчета.Сеть = ПараметрыДляНовогоДокумента.Сеть;
	
	СтруктураПараметров =  ПолучитьПараметрыРасчета(ПараметрыДляНовогоДокумента.НачалоПериодаДокумента,ПараметрыДляНовогоДокумента.Сеть);
	Если НЕ СтруктураПараметров = Неопределено Тогда
		СтрокаРасчета.ПроцентПремии = СтруктураПараметров.ПроцентПремии;
		//СтрокаРасчета.ФиксированнаяСуммаПремии = СтруктураПараметров.ФиксированнаяСумма;
	КонецЕсли;
	
	СтруктураРасчета = ПолучитьФактТоварооборотаИзРегистра(ПараметрыДляНовогоДокумента.Контрагент,ПараметрыДляНовогоДокумента.Сеть,ДанныеФормы.НачалоПериода,	ДанныеФормы.КонецПериода);
	СтрокаРасчета.Товароборот = СтруктураРасчета.Товарооборот;
	СтрокаРасчета.ФиксированнаяСуммаПремии = СтруктураРасчета.ФиксированнаяСумма; 
	СтрокаРасчета.Премия = (СтруктураРасчета.Товарооборот /100) *  СтруктураПараметров.ПроцентПремии;
	
КонецПроцедуры



&НаКлиенте
Процедура ОбновитьДвнные(Команда)
	ОбновитьДеревоЗначение ();
КонецПроцедуры

&НаКлиенте
Процедура СформироватьОтчетЛео_ФактТоварооборотаНепрямыхКлиентов(ПараметрыДляОтчета)
	//тФорма = ПолучитьФорму("Отчет.Лео_ФактТоварооборотаНепрямыхКлиентов.Форма");
	//тОтчет = тФорма.Отчет;
	//НастройкиКД = тОтчет.КомпоновщикНастроек.ПолучитьНастройки();;
	//
	////тОтчет = Отчеты.Лео_ФактТоварооборотаНепрямыхКлиентов.Создать();
	////НастройкиКД = тОтчет.КомпоновщикНастроек.ПолучитьНастройки();

	//ПолеКонтрагента = тОтчет.КомпоновщикНастроек.Настройки.Отбор.ДоступныеПоляОтбора.Элементы.Найти("Контрагент"); 
	//ПолеСеть = тОтчет.КомпоновщикНастроек.Настройки.Отбор.ДоступныеПоляОтбора.Элементы.Найти("Сеть"); //поле отбора присутствует в СКД

	////ПолеДатаС = тОтчет.КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("ДатаС");
	////ПолеДатаС.Значение = ПараметрыДляОтчета.НачалоПериодаДокумента;
	////ПолеДатаПо = тОтчет.КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("ДатаПо");
	////ПолеДатаПо.Значение = КонецКвартала(ПараметрыДляОтчета.НачалоПериодаДокумента);
	//тОтчет.КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ДатаС",ПараметрыДляОтчета.НачалоПериодаДокумента);
	//тОтчет.КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ДатаПо",КонецКвартала(ПараметрыДляОтчета.НачалоПериодаДокумента));
	//
	//НовыйОтбор = НастройкиКД.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	//НовыйОтбор.ЛевоеЗначение = ПолеКонтрагента.Поле;
	//НовыйОтбор.ПравоеЗначение = ПараметрыДляОтчета.Контрагент;
	//НовыйОтбор.Использование = Истина;

	//НовыйОтбор = НастройкиКД.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	//НовыйОтбор.ЛевоеЗначение = ПолеСеть.Поле;
	//НовыйОтбор.ПравоеЗначение = ПараметрыДляОтчета.Сеть;
	//НовыйОтбор.Использование = Истина;

	//тОтчет.КомпоновщикНастроек.ЗагрузитьНастройки(НастройкиКД);
	////тФорма = тОтчет.ПолучитьФорму("ФормаОтчета");
	////тОтчет.СкомпоноватьРезультат(тФорма.Результат); 
	//тФорма.ОткрытьМодально();	
	
	СтруктураОтбора = Новый Структура;
	СтруктураОтбора.Вставить("Контрагент", ПараметрыДляОтчета.Контрагент);
	СтруктураОтбора.Вставить("Сеть", ПараметрыДляОтчета.Сеть);
	
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("СформироватьПриОткрытии",     Истина);
	ПараметрыФормы.Вставить("Отбор",СтруктураОтбора);
	ПараметрыФормы.Вставить("ДатаС",ПараметрыДляОтчета.НачалоПериодаДокумента);
	ПараметрыФормы.Вставить("ДатаПо",КонецКвартала(ПараметрыДляОтчета.НачалоПериодаДокумента));	
	ПараметрыФормы.Вставить("КлючВарианта" , "БезПараметров");
	
	ОткрытьФорму("Отчет.Лео_ФактТоварооборотаНепрямыхКлиентов.Форма",ПараметрыФормы,,);

КонецПроцедуры

&НаСервере
Функция ПолучитьПараметрыРасчета(ДатаСреза,Сеть)
	
	СтруктураПараметров  = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Лео_ПареметрыРасчетаПремииКлиентамСрезПоследних.Контрагент,
		|	Лео_ПареметрыРасчетаПремииКлиентамСрезПоследних.Сеть,
		|	Лео_ПареметрыРасчетаПремииКлиентамСрезПоследних.Периодичность,
		|	Лео_ПареметрыРасчетаПремииКлиентамСрезПоследних.Договор,
		|	Лео_ПареметрыРасчетаПремииКлиентамСрезПоследних.ПроцентПремии,
		|	Лео_ПареметрыРасчетаПремииКлиентамСрезПоследних.ФиксированнаяСумма,
		|	Лео_ПареметрыРасчетаПремииКлиентамСрезПоследних.ГодовойТоварооборот,
		|	Лео_ПареметрыРасчетаПремииКлиентамСрезПоследних.Действует
		|ИЗ
		|	РегистрСведений.Лео_ПареметрыРасчетаПремииКлиентам.СрезПоследних(
		|			&ДатаСреза,
		|			Сеть = &Сеть
		|				И Действует = ИСТИНА) КАК Лео_ПареметрыРасчетаПремииКлиентамСрезПоследних";

	Запрос.УстановитьПараметр("ДатаСреза", ДатаСреза);
	Запрос.УстановитьПараметр("Сеть", Сеть);

	Результат = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = Результат.Выбрать();

	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		СтруктураПараметров = Новый Структура("ПроцентПремии, ФиксированнаяСумма", ВыборкаДетальныеЗаписи.ПроцентПремии ,ВыборкаДетальныеЗаписи.ФиксированнаяСумма);

	КонецЦикла;

	Возврат СтруктураПараметров 	
КонецФункции

&НаСервере
Функция ПолучитьФактТоварооборотаИзРегистра(Контрагент,Сеть,НачалоПериода,КонецПериода)
	
	СтруктураРасчета  = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Лео_ПланФактПримииНепрямымКлиентам.Сеть,
		|	СУММА(Лео_ПланФактПримииНепрямымКлиентам.Премия) КАК Премия,
		|	СУММА(Лео_ПланФактПримииНепрямымКлиентам.ФиксированнаяСумма) КАК ФиксированнаяСумма,
		|	СУММА(Лео_ПланФактПримииНепрямымКлиентам.Товарооборот) КАК Товарооборот
		|ИЗ
		|	РегистрНакопления.Лео_ПланФактПримииНепрямымКлиентам КАК Лео_ПланФактПримииНепрямымКлиентам
		|ГДЕ
		|	Лео_ПланФактПримииНепрямымКлиентам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|	И Лео_ПланФактПримииНепрямымКлиентам.Контрагент = &Контрагент
		|	И Лео_ПланФактПримииНепрямымКлиентам.Сеть = &Сеть
		|	И Лео_ПланФактПримииНепрямымКлиентам.Период МЕЖДУ &НачалоПериода И &КонецПериода
		|
		|СГРУППИРОВАТЬ ПО
		|	Лео_ПланФактПримииНепрямымКлиентам.Сеть";

	Запрос.УстановитьПараметр("КонецПериода", КонецПериода);
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	Запрос.УстановитьПараметр("Сеть", Сеть);

	Результат = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = Результат.Выбрать();

	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		СтруктураРасчета = Новый Структура("Премия, ФиксированнаяСумма, Товарооборот", ВыборкаДетальныеЗаписи.Премия ,ВыборкаДетальныеЗаписи.ФиксированнаяСумма , ВыборкаДетальныеЗаписи.Товарооборот);

	КонецЦикла;
	
	Если СтруктураРасчета =  Неопределено Тогда
		СтруктураРасчета = Новый Структура("Премия, ФиксированнаяСумма, Товарооборот",0 ,0 , 0);
	КонецЕсли;
		

	Возврат СтруктураРасчета
	
КонецФункции
